const quiz = [
    {
    id: 1,
    // img: null,
    question: "Светафорнинг яшил милтилловчи ишораси нимани билдиради? ",
    options: ["Светафор носозлигини", "Ҳаракатга рухсат беради ва тез орада тақиқловчи ишора ёниши тўғрисида ахборот беради", "Ҳаракатни давом эттиришни тақиқлайди",],
    correct: 0,
},
{
    id: 2,
    img: 'img/71.2.png',
    question: "Ушбу жойда автомобилни тўхтаб туриш учун қўйишга рухсат этиладими?",
    options: ["Ҳа", "Нет"],
    correct: 1,
},
{
    id: 3,
    img: 'img/71.3.png',
    question: "Сиз чорраҳадан тўғрига ўтмоқчисиз. Ушбу вазиятда Сизнинг ҳаракатингиз?",
    options: ["Чорраҳага биринчи кирган қизил автомобилга йўл бериш", "Қизил автомобиль йўл бераётганига ишонч хосил қилиб чорраҳадан биринчиўтиш",],
    correct: 1

},
{
    id: 4,
    img: 'img/71.4.png',
    question: "Сиз чорраҳадан чапга бурилмоқчисиз. Ушбу вазиятда кимга йўл берасиз?",
    options: ["Фақат автобусга", "Фақат қизил автомобилга", "Ҳеч кимга",],
    correct: 1
},
{
    id: 5,
    // img: null,
    question: "Қайси ҳолларда йўлнинг ҳаракатланиш бўлагини ажратувчи узуқ-узуқ чизиқни босиб ўтиш мумкин?",
    options: ["Фақат қайта тизилишда", "Йўлда бошқа транспорт воситалари бўлмаса", "Барча санаб ўтилган ҳолларда",],
    correct: 1
},
{
    id: 6,
    img: 'img/71.6.png',
    question: " Ушбу кўрсатилган ҳолатда мототцикл ҳайдовчиси сизга йўл бериши керакми?",
    options: ["Йўқ", "Ҳа ",],
    correct: 1
}, {
    id: 7,
    question: "Санаб ўтилган қайси ҳолларда эгилувчан улагичда шатакка олиш тақиқланади?",
    answer: ["Фақат тоғли йўлларда", "Йўл яхмалак, сирпанчиқ бўлган ҳолларда", "Куннинг қоронғи вақтида ва етарли кўринмаслик шароитида", "Барча санаб ўтилган ҳолларда",],
    correct: 1
},
{
    id: 8,
    img: 'img/71.8.png',
    question: "Ушбу белгилардан қайси бири бир томонлама ҳаракат ташкил қилинган йўлнинг бошида ўpнaтилaди?",
    options: ["Фақат «А» ", "Фақат «Б» ", "«Б» ва «Г» ", "«Б» ёки «В» ",],
    correct: 1
},
{
    id: 9,
    img: 'img/71.9.png',
    question: "Ушбу йўл нечта ҳаракатланиш бўлагига эга?",
    options: ["Битта ҳаракатланиш бўлагига", "Иккита ҳаракатланиш бўлагига", "Учта ҳаракатланиш бўлагига"],
    correct: 1
},
{
    id: 10,
    // img: null,
    question: "Йўлда «ТЎХТАШ», ёзуви кўринишидаги йўл чизиғи нимани билдиради? ",
    options: ["Тартибга солинган чорраҳада тўхташ чизиғига яқинлашаётганлиги хақида огоҳлантиради", "Тўхташ чизиғи ва «Тўхтамасдан ҳаракатланиш тақиқланади» йўл белгиси ўрнатилган йўл қисмига яқинлашаётганлигини билдиради", "«Йўл беринг» йўл белгисига яқинлашаётганлигини билдиради"],
    correct: 1
},
{
    id: 11,
    img: 'img/72.1.png',
    question: "Қайси ҳайдовчи тўхтаб туриш қоидасини бузди?",
    options: ["Мототцикл ҳайдовчиси", "Тротуарда тўхтаб турган автомобиль ҳайдовчиси", "Ҳеч ким бузмади"],
    correct: 1
},
{
    id: 12,
    // img: null,
    question: "Typap жой даҳаларида қандай ҳаракатлар тақиқланган?",
    options: ["Фақат ўқув машғулотларини бажариш", "Фақат двигатель ишлаб турганда тўхтаб туриш", "Барча санаб ўтилган ҳолларда"],
    correct: 1
},
{
    id: 13,
    // img: null,
    question: "Транспорт воситалари қаттиқ улагичда шатакка олинганда шатакка олган ва шатакка олинган транспорт воситалари орасидаги масофа қанча бўлиши керак?",
    options: ["4 метрдан ошмаслиги", "4 метрдан 6 метргача", "Қоидаларда белгиланмаган"],
    correct: 1
},
{
    id: 14,
    // img: null,
    question: "Санаб ўтилган қайси ҳолатда транспорт воситасидан фойдаланишга рухсат этилади?",
    options: ["Ташқи ёритгич асбоблари ифлосланган бўлса", "Ёритувчи чироқ нурининг йўналиши бузилган бўлса", "Олд қисмида - оқ ёки сариқ рангли туманга қарши фаралар ўрнатилган бўлса"],
    correct: 1
},
{
    id: 15,
    // img: null,
    question: "Йўлнинг сирпанчиқ қисмида руль чамбарагини кескин бурганда ҳосил бўладиган сирпанишнинг олдини олиш учун ҳайдовчи қандай эҳтиёт чораларини кўриши керак?",
    options: ["Руль чамбарагини зудлик билан сирпанаётган томонга буриш ва тезда автомобилни ҳаракат йўналишини тўғирлаб олиш", "Илашмани узиш", "Тормоз тепкисини босиш"],
    correct: 1
},
{
    id: 16,
    img: 'img/72.6.png',
    question: "Кўрсатилган йўл белгиларидан қайси бири фақат йўл қопламаси нам бўлганда таъсир этади?",
    options: ["Фақат «А»", "Фақат «А» ва «Б»", "Барчаси"],
    correct: 1
},
{
    id: 17,
    img: 'img/72.7.png',
    question: "Юк автомобили ҳайдовчиси тўхтаб туриш қоидасини буздими?",
    options: ["Бузди", "Бузмади, aгap унинг рухсат этилган тўлиқ вазни 3,5 тоннадан ошмаса", "Хато қилмади"],
    correct: 1
},
{
    id: 18,
    // img: null,
    question: "Қандай ҳолларда аҳоли пунктларида товуш мосламаларидан фойдаланишга рухсат этилади?",
    options: ["Қувиб ўтишда огоҳлантириш учун", "Йўл-транспорт ҳодисасининг олдини олиш учун", "Ҳар иккала санаб ўтилган ҳолларда"],
    correct: 1
},
{
    id: 19,
    img:'img/72.9.png',
    question: "Кўрсатилган қайси белгилар сизга яшаш манзилингизга автомобилда ўтишга рухсат беради?",
    options: ["Фақат «А»", "Фақат «Б»", "Фақат «А» ва «B»", "Барчаси"],
    correct: 1
},
{
    id: 20,
    // img: null,
    question: "Чорраҳага кирганингизда тартибга солувчи қўлини юқорига кўтарди, сизга ҳаракатланишга рухсат этиладими?",
    options: ["Рухсат этилмайди", "Рухсат этилади, агарда сиз ўнгга буриладиган бўлсангиз", "Рухсат этилади"],
    correct: 1
},
]
